Repository: universalcore/unicore-cms-gem
Catalog: unicorecmsgem/locale/hau_NG/LC_MESSAGES/unicorecmsgem.po
Languages: ha

source: What Is The Girl Effect
ha: Mene ne Girl Effect?

source: Learn more about The Girl Effect
ha: Ƙara koyo dangane da Girl Effect

source: And spread the word
ha: Da kuma yada kalmar.

source: Latest
ha: Na kwana-kwanan nan

source: More
ha: Ƙari

source: The Girl Declaration
ha: Shelar ‘Yan Mata

source: Read It Now.
ha: Karanta shi yanzu.

source: And share it with other girls
ha: Kuma ki yi musayansa tare da sauran ‘yan mata

source: Contact
ha: Abokan hulɗa

source: Terms &amp; Conditions
ha: Ka’idojin Amfani

source: Tips on Use
ha: Shawarwari kan Amfani

source: Home
ha: Gida
